---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Weight
source: html/00fe25ae-0a9e-3c4f-7f9a-3793043497c7.htm
---
# Autodesk.Revit.DB.SpecTypeId.Weight Property

Weight, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Weight { get; }
```